Repository: JoseAntonioRodriguez/pyRenamer
Catalog: pyrenamer/po/*.po
Languages: cs

source: Mass rename files
cs: Přejmenovat soubory

source: * Select every visible file *.jpg Select just files that end with the "jpg" extension Select every file (including hidden ones) .* Select files starting by "."
cs: * Vyberte soubor *.jpg Vyberte soubory končící na "jpg" příponu Vyberte soubory (včetně skrytých) .* Vyberte soubory začínající na "."

source: <b>Common substitutions</b>
cs: <b>Běžné zpracování</b>

source: <b>Default directories</b>
cs: <b>Výchozí adresář</b>

source: <b>Insert or delete characters from filenames</b>
cs: <b>Vložit nebo odtranit znaky</b>

source: <b>Options</b>
cs: <b>Volby</b>

source: <b>Rename files manually</b>
cs: <b>Ruční přejmenování</b>

source: <b>Rename files using patterns</b>
cs: <b>Přejmenovat soubory</b>

source: <b>Rename images using their metadata</b>
cs: <b>Přejmenovat obrázek</b>

source: <b>Rename music using its metadata</b>
cs: <b>Přejmenovat hudbu</b>

source: <i>Put the mouse over the text fields to get help on which patterns you can use</i>
cs: <i>Nápověda</i>

source: <i>Select the file to rename, change its name and click Preview</i>
cs: <i>Vyberte soubor k přejmenování a klikněte na náhled</i>

source: <i>The default selected directory</i>
cs: <i>Výchozí adresář</i>

source: <i>The parent of the directories tree</i>
cs: <i>Adresáře</i>

source: Active
cs: Aktivní

source: Add files recursively
cs: Přidat soubory

source: Add pattern
cs: Přidat

source: All uppercase All downcase First letter uppercase First letter uppercase of each word
cs: Všechna velká Všechna malá První písmeno velké První písmeno každého slova velké

source: Browse...
cs: Procházet...

source: C_lear
cs: V_ymazat

source: C_lear Preview
cs: S_mazat náhled

source: Capitalization
cs: Zkontrolovat velká písmena

source: Changes: ..... to . ---- to - ____ to _ ' ' to ' '
cs: Změnit: ..... na . ---- na - ____ na _ ' ' na ' '

source: Delete from
cs: Odstranit

source: Files Directories Files and directories
cs: Soubory Složky Soubory a složky

source: Fix duplicated symbols
cs: Opravit chyby

source: Image metadata replacements: {imagewidth} 640 {imageheight} 480 {cameramaker} Nikon {cameramodel} D-50 {imagedate} 22feb1980 {imageyear} 1980 {imagemonth} 02 {imagemonthname} february {imagemonthsimp} feb {imageday} 22 {imagedayname} friday {imagedaysimp} fri {imagetime} 13_56_02 {imagehour} 13 {imageminute} 56 {imagesecond} 02 Common replacements: Use {1} for first catched item. {2} for second, etc... Use {num} for adding 1, 2, 3... to file names Use {num2} for 01, 02, 03..... Use {num3} for 001, 002, 003... Use {num+10} for 10, 11, 12... Use {num2+10} for 010, 011, 012... Use {dir} for getting current dir Some today date replacements: {date} 22feb1980 {year} 1980 {month} 02 {monthname} february {monthsimp} feb {day} 22 {dayname} friday {daysimp} fri Random number replacements: {rand} is random number between 0 and 100. {rand,3} is random number between 0 and 100 of 3 digits (012) {rand500} is random number between 0 and 500 {rand10-20} is random number between 10 and 20 {rand20,5} is random number between 0 and 20 of 5 digits (00012)
cs: Získání metadat z obrázku: {imagewidth} 640 ... šířka o brázku {imageheight} 480 ... výška obrázku {cameramaker} Nikon ... značka fotoaparátu {cameramodel} D-80 ... typ fotoaparátu {imagedate} 22led2008 ... datum pořízení {imageyear} 2008 ... rok {imagemonth} 02 ... měsíc {imagemonthname} leden ... měsíc {imagemonthsimp} led ... měsíc {imageday} 22 ... den {imagedayname} pátek ... den v týdnu {imagedaysimp} pát ... den v týdnu {imagetime} 13_56_02 ... čas pořízení snímku {imagehour} 13 ... hodina pořízení snímku {imageminute} 56 ... minuta pořízení snímku {imagesecond} 02 ... vteřiny pořízení snímku Obecný název: Použít {1} pro první položku. {2} pro druhou, atd.... Použít {num} 1, 2, 3... pro název souboru Použít {num2} pro 01, 02, 03..... Použít {num3} pro 001, 002, 003... Použít {num+10} pro 10, 11, 12... Použít {num2+10} pro 010, 011, 012... Použít {dir} pro aktuální adresář Změna dnešního dne: {date} 22led2008 {year} 2008 {month} 02 {monthname} leden {monthsimp} led {day} 22 {dayname} pátek {daysimp} pát Změna náhodného čísla: {rand} náhodné číslo je mezi 0 a 100. {rand,3} náhodné číslo je mezi 0 a 100 ze 3 číslic (012) {rand500} náhodné číslo je mezi 0 a 500 {rand10-20} náhodné číslo je mezi 10 a 20 {rand20,5} náhodné číslo je mezi 0 a 20 z 5 číslic (00012)

source: Images
cs: Obrázky

source: Insert
cs: Vložit

source: Insert / Delete
cs: Vložit / Odstranit

source: Keep extensions
cs: Ponechat

source: Manual rename
cs: Přejmenovat

source: Music
cs: Hudba

source: Music metadata replacements: {artist} AnxiA {title} El mundo no es una mercancía {album} Jóven pájaro negro muerto {track} 02 {tracktotal} 10 {myear} 2006 {genre} Hardcore Common replacements: Use {1} for first catched item. {2} for second, etc... Use {num} for adding 1, 2, 3... to file names Use {num2} for 01, 02, 03..... Use {num3} for 001, 002, 003... Use {num+10} for 10, 11, 12... Use {num2+10} for 010, 011, 012... Use {dir} for getting current dir Some today date replacements: {date} 22feb1980 {year} 1980 {month} 02 {monthname} february {monthsimp} feb {day} 22 {dayname} friday {daysimp} fri Random number replacements: {rand} is random number between 0 and 100. {rand,3} is random number between 0 and 100 of 3 digits (012) {rand500} is random number between 0 and 500 {rand10-20} is random number between 10 and 20 {rand20,5} is random number between 0 and 20 of 5 digits (00012)
cs: Získání metadat z audio souboru: {artist} Queen ... zpěvák nebo skupina {title} One Year Of Love ... název písně {album} A Kind Of Magic ... název alba {track} 02 ... stopa č... {tracktotal} 10 ... celkový počet stop {myear} 2006 ... rok {genre} Hardcore ... styl hudby Vložení obecného názvu: Použít {1} pro první položku. {2} pro druhou, atd.... Použít {num} 1, 2, 3... pro název souboru Použít {num2} pro 01, 02, 03..... Použít {num3} pro 001, 002, 003... Použít {num+10} pro 10, 11, 12... Použít {num2+10} pro 010, 011, 012... Použít {dir} pro aktuální adresář Vložení dne: {date} 22led1980 ... dnešní den {year} 2008 ... rok {month} 02 ... měsíc {monthname} leden ... měsíc {monthsimp} led ... měsíc {day} 22 ... den {dayname} pátek ... den v týdnu {daysimp} pát ... den v týdnu Vložení náhodného čísla: {rand} náhodné číslo je mezi 0 a 100. {rand,3} náhodné číslo je mezi 0 a 100 ze 3 číslic (012) {rand500} náhodné číslo je mezi 0 a 500 {rand10-20} náhodné číslo je mezi 10 a 20 {rand20,5} náhodné číslo je mezi 0 a 20 z 5 číslic (00012)

source: New file name
cs: Název nového souboru

source: Original file name pattern
cs: Původní jméno souboru

source: Pattern editor
cs: Editor vzorků

source: Pattern:
cs: Vzorek:

source: Patterns
cs: Vzorky

source: Preview automatically
cs: Náhled

source: Remove accents
cs: Odebrat

source: Renamed file name pattern
cs: Jméno souboru

source: Replace
cs: Nahradit

source: Select _nothing
cs: Nevybrat _nic

source: Select _all
cs: Vybrat _vše

source: Selection pattern
cs: Výběr vzorku

source: Show options
cs: Možnosti

source: Spaces
cs: Mezery

source: Spaces to Underscores Underscores to Spaces Spaces to Dots Dots to Spaces Spaces to Dashes Dashes to Spaces
cs: Nahradit mezeru podtržítkem Nahradit podtržítko mezerou Nahradit mezeru tečkou Nahradit tečku mezerou Nahradit mezeru pomlčkou Nahradit pomlčku mezerou

source: Substitutions
cs: Nahrazení

source: Use {1} for first catched item. {2} for second, etc... Use {num} for adding 1, 2, 3... to file names Use {num2} for 01, 02, 03..... Use {num3} for 001, 002, 003... Use {num+10} for 10, 11, 12... Use {num2+10} for 010, 011, 012... Use {dir} for getting current dir Some today date replacements: {date} 22feb1980 {year} 1980 {month} 02 {monthname} february {monthsimp} feb {day} 22 {dayname} friday {daysimp} fri Random number replacements: {rand} is random number between 0 and 100. {rand,3} is random number between 0 and 100 of 3 digits (012) {rand500} is random number between 0 and 500 {rand10-20} is random number between 10 and 20 {rand20,5} is random number between 0 and 20 of 5 digits (00012)
cs: Obecný název: Použít {1} pro první položku. {2} pro druhou, atd.... Použít {num} 1, 2, 3... pro název souboru Použít {num2} pro 01, 02, 03..... Použít {num3} pro 001, 002, 003... Použít {num+10} pro 10, 11, 12... Použít {num2+10} pro 010, 011, 012... Použít {dir} pro aktuální adresář Vložení dne: {date} 22led1980 ... dnešní den {year} 2008 ... rok {month} 02 ... měsíc {monthname} leden ... měsíc {monthsimp} led ... měsíc {day} 22 ... den {dayname} pátek ... den v týdnu {daysimp} pát ... den v týdnu Vložení náhodného čísla: {rand} náhodné číslo je mezi 0 a 100. {rand,3} náhodné číslo je mezi 0 a 100 ze 3 číslic (012) {rand500} náhodné číslo je mezi 0 a 500 {rand10-20} náhodné číslo je mezi 10 a 20 {rand20,5} náhodné číslo je mezi 0 a 20 z 5 číslic (00012)

source: _Edit
cs: _Upravit

source: _File
cs: _Soubor

source: _Help
cs: _Nápověda

source: _Load names from file...
cs: _Načíst ze souboru

source: _Preview
cs: _Náhled

source: _Rename
cs: _Přejmenovat

source: _View
cs: _Zobrazit

source: at
cs: na

source: from the end
cs: konec

source: or at the end
cs: na konci

source: pyRenamer preferences
cs: nastavení

source: to
cs: do

source: with
cs: s

source: {#} Numbers {L} Letters {C} Characters (numbers and letters, not spaces) {X} Numbers, letters, and spaces {@} Trash
cs: {#} Čísla {L} Písmena {C} Znaky (čísla a písmena nejsou dovoleny) {X} Čísla, písmena a mezery {@} Koš

source: {#} Numbers {L} Letters {C} Characters (numbers and letters, not spaces) {X} Numbers, letters, and spaces {@} Trash
cs: {#} Čísla {L} Písmena {C} Znaky (čísla a písmena nejsou dovoleny) {X} Čísla, písmena a mezery {@} Koš

source: 0: Rename files / 1: Rename directories / 2: Rename files and directories
cs: 0: Přejmenovat soubory / 1: Přejmenovat složky / 2: Přejmenovat vše

source: Auto preview changes
cs: Náhled

source: Default active dir
cs: Výchozí adresář

source: Default root dir
cs: Kořenový adresář

source: Display the options pane
cs: Možnosti zobrazení

source: Is the window maximized?
cs: Maximalizovat okno

source: Keep files extensions
cs: Všechny soubory

source: Position of the pane separator
cs: Oddělovač

source: Rename files or directories
cs: Přejmenovat soubory

source: Window height
cs: Výška okna

source: Window width
cs: Šířka okna

source: X position of the window
cs: Pozice X

source: Y position of the window
cs: Pozice Y

source: Original file name
cs: Původní jméno souboru

source: Renamed file name
cs: Jméno souboru

source: Could not rename file %s to %s %s
cs: Nemohu přejmenovat soubor %s z %s %s

source: Select file
cs: Vybrat

source: Reading contents of dir %s
cs: Obsah %s

source: Directory: %s - Files: %s
cs: Adresář: %s - Soubory: %s

source: Adding file %s
cs: Přidává se soubor %s

source: Ignore errors
cs: Ignorovat chyby

source: translator-credits
cs: Luboš Toman <lubos.pb@centrum.cz>

source: Mass file renamer for GNOME
cs: Přejmenování souborů

source: Error while renaming %s to %s! -> %s already exists!
cs: Chyba při přejmenování %s z %s! -> %s již existuje!

source: Error while renaming %s to %s!
cs: Chyba při přejmenování %s z %s!

source: Patterns editor
cs: Editor

source: Image patterns editor
cs: Editor obrázků

source: Music patterns editor
cs: Editor hudby

source: Select root directory
cs: Zvolit adresář root

source: Select active directory
cs: Zvolit adresář

source: The root directory is not valid! Please select another directory.
cs: Do adresáře root nelze zapisovat! Vyberte jiný.

source: The active directory is not valid! Please select another directory.
cs: Do adresáře nelze zapisovat! Vyberte jiný.

source: Please set both directories!
cs: Čekejte prosím

source: <b>Original: </b> %s <b>Renamed: </b> %s
cs: <b>Originál: </b> %s <b>Přejmenováno: </b> %s

source: <b>Original: </b> %s
cs: <b>Originál: </b> %s

source: Show hidden files
cs: Zobrazit skryté soubory
