Repository: JoseAntonioRodriguez/pyRenamer
Catalog: po/*.po
Languages: es, fr

source: Rename your files
es: Renombrar sus archivos
fr: Renomme les fichiers

source: pyRenamer is an application for mass file renaming.
es: pyRenamer es una aplicación para el renombrado masivo de archivos.

source: Files can be renamed using patterns, substitutions, inserting or deleting text, or even manually. Image files can be also renamed using their EXIF tags and music files can be renamed using their internal metadata.
es: Los archivos se pueden renombrar utilizando patrones, sustituciones, insertando o borrando texto, o incluso manualmente. Los archivos de imagen se pueden renombrar usando sus etiquetas EXIF y los archivos de música se pueden renombrar usando sus metadatos internos.

source: pyRenamer has been completely rewritten to be compliant with modern Linux distributions.
es: pyRenamer se ha reescrito por completo para hacerlo compatible con distribuciones Linux modernas.

source: Mass file renamer
es: Renombrado masivo de archivos
fr: Renommage en masse de fichiers

source: rename;
es: renombrar;
fr: renomme;

source: Window maximized state
es: Estado maximizado de la ventana
fr: État de maximisation de la fenêtre

source: Window position (x coordinate)
es: Posición de la ventana (coordenada x)
fr: Position de la fenêtre (coordonnée x)

source: Window position (y coordinate)
es: Posición de la ventana (coordenada y)
fr: Position de la fenêtre (coordonnée y)

source: Window width
es: Anchura de la ventana
fr: Largeur de la fenêtre

source: Window height
es: Altura de la ventana
fr: Hauteur de la fenêtre

source: Separator position
es: Posición del separador
fr: Position du séparateur

source: Position of the separator between the directory tree and the files viewer.
es: Posición del separador situado entre el árbol de directorios y el visor de archivos.

source: Options pane visibility state
es: Estado de visibilidad del panel de opciones
fr: État de visibilité du panneau d'options

source: Whether the options pane must be shown at startup.
es: Indica si el panel de opciones debe mostrarse al inicio.

source: Default root directory
es: Directorio raíz predeterminado
fr: Répertoire racine par défaut

source: Default root of the directory tree.
es: Directorio raíz predeterminado del árbol de directorios.

source: Default active directory
es: Directorio activo predeterminado
fr: Répertoire actif par défaut

source: Default active directory in the directory tree.
es: Directorio activo predeterminado en el árbol de directorios.

source: Show hidden files/directories
es: Mostrar archivos/directorios ocultos
fr: Afficher les fichiers/répertoires cachés

source: Whether hidden files and directories must be shown.
es: Indica si se muestran archivos y directorios ocultos.

source: Renaming mode
es: Modo de renombrado
fr: Mode de renommage

source: Indicates if renaming operations must be applied over files, directories, or both.
es: Indica si las operaciones de renombrado deben aplicarse sobre archivos, directorios, o ambos.

source: Selection pattern
es: Patrón de selección de archivos
fr: Règle de sélection des fichiers

source: Pattern used to select files to be renamed.
es: Patrón utilizado para seleccionar los archivos a renombrar.

source: Add files recursively
es: Añadir archivos recursivamente
fr: Ajouter les fichiers récursivement

source: Whether files are added recursively.
es: Añadir archivos recursivamente.

source: Keep file extensions
es: Mantener extensiones de archivos
fr: Garder les extensions des fichiers

source: Whether file extensions must be kept when renaming.
es: Indica si las extensiones de archivos deben mantenerse cuando se renombra.

source: Auto preview changes
es: Auto previsualizar los cambios
fr: Aperçu automatique des changements

source: Automatically show changes without clicking the Preview button.
es: Mostrar cambios automáticamente sin pulsar el botón de Previsualización.

source: Original file/directory name patterns
es: Patrones de nombre de archivo/directorio original
fr: Règle du nom de fichier/répertoire original

source: List of patterns to apply to the original file/directory name in the "Patterns" tab.
es: Lista de patrones a aplicar al nombre de archivo/directorio original en la pestaña "Patrones".

source: Renamed file/directory name patterns
es: Patrones de nombre de archivo/directorio renombrado
fr: Règle du nom de fichier/répertoire renommé

source: List of patterns to use for the renamed file/directory name in the "Patterns" tab.
es: Lista de patrones a utilizar en el nombre del archivo/directorio en la pestaña "Patrones".

source: Original file name patterns for images
es: Patrones de nombre de archivo original para imágenes
fr: Règle du nom de fichier original pour les images

source: List of patterns to apply to the original file name in the "Images" tab.
es: Lista de patrones a aplicar al nombre de archivo original en la pestaña "Imágenes".

source: Renamed file name patterns for images
es: Patrones de nombre de archivo renombrado para imágenes
fr: Règle du nom de fichier renommé pour les images

source: List of patterns to use for the renamed file name in the "Images" tab.
es: Lista de patrones a utilizar en el nombre del archivo en la pestaña "Imágenes".

source: Original file name patterns for music
es: Patrones de nombre de archivo original para música
fr: Règle du nom de fichier original pour la musique

source: List of patterns to apply to the original file name in the "Music" tab.
es: Lista de patrones a aplicar al nombre de archivo original en la pestaña "Música".

source: Renamed file name patterns for music
es: Patrones de nombre de archivo renombrado para música
fr: Règle du nom de fichier renommé pour la musique

source: List of patterns to use for the renamed file name in the "Music" tab.
es: Lista de patrones a utilizar en el nombre del archivo en la pestaña "Música".

source: Root of the directory tree
es: Raíz del árbol de directorios

source: ROOT_DIR
es: DIR_RAÍZ

source: Show release version
es: Mostrar el número de versión

source: [ACTIVE_DIR]
es: [DIR_ACTIVO]

source: Error: ROOT_DIR must be an existing directory
es: Error: DIR_RAÍZ debe existir y ser un directorio

source: Error: Only one ACTIVE_DIR is allowed
es: Error: Solo se permite un DIR_ACTIVO

source: Error: ACTIVE_DIR must be an existing subdirectory of ROOT_DIR
es: Error: DIR_ACTIVO debe existir y ser un subdirectorio de DIR_RAÍZ

source: Reading contents of directory '{}'...
es: Leyendo el contenido del directorio '{}'...
fr: Parcoure le contenu du répertoire '{}'...

source: Directory '{}' contains {} directories and {} files
es: El directorio '{}' contiene {} directorios y {} archivos
fr: Le répertoire '{}' contient {} répertoires et {} fichiers

source: Hide the options pane
es: Oculta el panel de opciones
fr: Montrer le panneau d'options

source: Show the options pane
es: Muestra el panel de opciones
fr: Masquer le panneau d'options

source: Could not rename file '{}' to '{}' {}
es: No se pudo renombrar el archivo '{}' a '{}' {}
fr: Le fichier n'a pas pu être renommé de '{}' en '{} {}

source: Ignore errors
es: Ignorar errores
fr: Ignorer les erreurs

source: <b>Original: </b>{}
es: <b>Original: </b>{}s

source: <b>Original: </b>{} <b>Renamed: </b>{}
es: <b>Original: </b>{} <b>Renombrado: </b>{}
fr: <b>Original: </b>{} <b>Renommé: </b>{}

source: {#} Numbers {L} Letters {C} Characters (numbers and letters, not spaces) {X} Numbers, letters, and spaces {@} Trash
es: {#} Números {L} Letras {C} Caracteres (números y letras, no espacios) {X} Números, letras y espacios {@} Basura
fr: {#} Chiffres {L} Lettres {C} Caractères (chiffres et lettres, pas d'espaces) {X} Chiffres, lettres et espaces {@} Corbeille

source: Common replacements: Use {1} for first matched item, {2} for second, etc... Use {num} for adding 1, 2, 3... to file names Use {num2} for adding 01, 02, 03... Use {num3} for adding 001, 002, 003... Use {num+10} for adding 10, 11, 12... Use {num2+10} for adding 010, 011, 012... Use {dir} for getting the current directory Some today date replacements: {date} 22Feb2022 {year} 2022 {month} 02 {monthname} February {monthsimp} Feb {day} 22 {dayname} Tuesday {daysimp} Tue Random number replacements: {rand} is a random number between 0 and 100. {rand,3} is a random number between 0 and 100 of 3 digits (012) {rand500} is a random number between 0 and 500 {rand10-20} is a random number between 10 and 20 {rand20,5} is a random number between 0 and 20 of 5 digits (00012)
es: Sustituciones comunes: Use {1} para la primera coincidencia. {2} para la segunda, etc... Use {num} para añadir 1, 2, 3... a los nombres de archivo Use {num2} para añadir 01, 02, 03..... Use {num3} para añadir 001, 002, 003... Use {num+10} para añadir 10, 11, 12... Use {num2+10} para añadir 010, 011, 012... Use {dir} para obtener el directorio actual Algunas sustituciones de la fecha actual: {date} 22feb2022 {year} 2022 {month} 02 {monthname} febrero {monthsimp} feb {day} 22 {dayname} martes {daysimp} mar Sustituciones con números aleatorios: {rand} es un número aleatorio entre 0 y 100. {rand,3} es un número aleatorio entre 0 y 100 de 3 dígitos (012) {rand500} es un número aleatorio entre 0 y 500 {rand10-20} es un número aleatorio entre 10 y 20 {rand20,5} es un número aleatorio entre 0 y 20 de 5 dígitos (00012)
fr: Substitutions générales: Utilisez {1} pour le premier segment. {2} pour le second, etc... Utilisez {num} pour ajouter 1, 2, 3... aux noms des fichiers Utilisez {num2} pour ajouter 01, 02, 03..... Utilisez {num3} pour ajouter 001, 002, 003... Utilisez {num+10} pour ajouter 10, 11, 12... Utilsez {num2+10} pour ajouter 010, 011, 012... Utilisez {dir} pour obtenir le dossier actuel Quelques substitutions avec la date actuelle: {date} 22fév2022 {year} 2022 {month} 02 {monthname} février {monthsimp} fév {day} 22 {dayname} mardi {daysimp} mar Substitutions aléatoires de nombres: {rand} est un nombre aléatoire entre 0 et 100. {rand,3} est un nombre aléatoire entre 0 et 100 de 3 chiffres (012) {rand500} est un nombre aléatoire entre 0 et 500 {rand10-20} est un nombre aléatoire entre 0 et 20 {rand20,5} est un nombre aléatoire entre 0 et 20 de 5 chiffres (00012)

source: Image metadata replacements: {imagewidth} 4272 {imageheight} 2848 {cameramaker} Canon {cameramodel} Canon EOS 1100D {imagedate} 22Feb2022 {imageyear} 2022 {imagemonth} 02 {imagemonthname} February {imagemonthsimp} Feb {imageday} 22 {imagedayname} Tuesday {imagedaysimp} Tue {imagetime} 20_15_38 {imagehour} 20 {imageminute} 15 {imagesecond} 38
es: Sustituciones de metadatos de imágenes: {imagewidth} 4272 {imageheight} 2848 {cameramaker} Canon {cameramodel} Canon EOS 1100D {imagedate} 22feb2022 {imageyear} 2022 {imagemonth} 02 {imagemonthname} febrero {imagemonthsimp} feb {imageday} 22 {imagedayname} martes {imagedaysimp} mar {imagetime} 20_15_38 {imagehour} 20 {imageminute} 15 {imagesecond} 38
fr: Substitutions par les métadonnées des images: {imagewidth} 4272 {imageheight} 2848 {cameramaker} Canon {cameramodel} Canon EOS 1100D {imagedate} 22fév2022 {imageyear} 2022 {imagemonth} 02 {imagemonthname} février {imagemonthsimp} fév {imageday} 22 {imagedayname} mardi {imagedaysimp} mar {imagetime} 20_15_38 {imagehour} 20 {imageminute} 15 {imagesecond} 38

source: Music metadata replacements: {artist} Queen {title} Bohemian Rhapsody {album} A Night at the Opera {track} 11 {tracktotal} 12 {myear} 1975 {genre} Rock
es: Sustituciones de metadatos de música: {artist} Queen {title} Bohemian Rhapsody {album} A Night at the Opera {track} 11 {tracktotal} 12 {myear} 1975 {genre} Rock
fr: Substitutions par les métadonnées de la musique: {artist} Queen {title} Bohemian Rhapsody {album} A Night at the Opera {track} 11 {tracktotal} 12 {myear} 1975 {genre} Rock

source: Repeated pattern
es: Patrón repetido
fr: Règle répétée

source: The pattern '{}' already exists.
es: El patrón '{}' ya existe.
fr: La règle '{}' existe déjà.

source: Invalid active directory
es: Directorio activo inválido
fr: Répertoire actif invalide

source: The active directory must be a subdirectory of the root directory.
es: El directorio activo deber ser un subdirectorio del directorio raíz.

source: Patterns
es: Patrones
fr: Règles

source: Substitutions
es: Sustituciones

source: Insert / Delete
es: Insertar / Eliminar
fr: Insérer / Effacer

source: Manual rename
es: Renombrado manual
fr: Renommage manuel

source: Images
es: Imágenes

source: Music
es: Música
fr: Musique

# shortcut window
source: Refresh
es: Actualizar

# shortcut window
source: Preview
es: Vista previa
fr: Aperçu

# shortcut window
source: Clear
es: Limpiar
fr: Vider

# shortcut window
source: Rename
es: Renombrar
fr: Renomme

# shortcut window
source: Preferences
es: Preferencias
fr: Préférences

# shortcut window
source: Quit
es: Salir

# shortcut window
source: Edit
es: Editar
fr: Édition

# shortcut window
source: Undo
es: Deshacer
fr: Annuler

# shortcut window
source: Redo
es: Rehacer
fr: Refaire

# shortcut window
source: Select all
es: Seleccionar todo
fr: Tout sélectionner

# shortcut window
source: Unselect all
es: Deseleccionar todo
fr: Tout déselectionner

# shortcut window
source: View
es: Vista
fr: Affichage

# shortcut window
source: Options pane
es: Panel de opciones
fr: Panneau d'options

# shortcut window
source: Menu
es: Menú

# shortcut window
source: Patterns
es: Patrones
fr: Règles

# shortcut window
source: Substitutions
es: Sustituciones

# shortcut window
source: Insert / Delete
es: Insertar / Eliminar
fr: Insérer / Effacer

# shortcut window
source: Manual rename
es: Renombrado manual
fr: Renommage manuel

# shortcut window
source: Images
es: Imágenes

# shortcut window
source: Music
es: Música
fr: Musique

source: _Select all
es: _Seleccionar todo
fr: _Tout sélectionner

source: _Unselect all
es: _Deseleccionar todo
fr: Tout _déselectionner

source: _Patterns
es: _Patrones
fr: _Règles

source: Su_bstitutions
es: S_ustituciones

source: _Insert / Delete
es: _Insertar / Eliminar
fr: _Insérer / Effacer

source: _Manual rename
es: Renombrado _manual
fr: Renommage _manuel

source: Imag_es
es: Imág_enes

source: Musi_c
es: Músi_ca
fr: Musi_que

source: P_references
es: P_referencias
fr: Pré_férences

source: _Keyboard Shortcuts
es: Atajos del _teclado
fr: Raccourcis _clavier

source: _About pyRenamer
es: _Acerca de pyRenamer
fr: À _propos de pyRenamer

source: Add pattern
es: Añadir patrón
fr: Ajouter une règle

source: _Cancel
es: _Cancelar

source: _OK
es: _Aceptar

source: Pattern:
es: Patrón:
fr: Règle:

source: Clear
es: Limpiar
fr: Vider

source: Preview
es: Vista previa
fr: Aperçu

source: Rename
es: Renombrar
fr: Renomme

source: Original file name
es: Nombre de archivo original
fr: Nom de fichier original

source: Renamed file name
es: Nombre de archivo renombrado
fr: Nouveau nom de fichier

source: Loading...
es: Cargando...

source: Cancel
es: Cancelar

source: Insert or delete characters from filenames
es: Insertar o borrar caracteres de los nombres de archivos
fr: Insérer ou effacer des caractères des noms de fichier

source: Insert
es: Insertar
fr: Insérer

source: at
es: en
fr: en

source: or at the end
es: o al final
fr: ou à la fin

source: Delete from
es: Eliminar desde
fr: Effacer à partir de

source: to
es: hasta
fr: à

source: from the end
es: desde el final
fr: depuis la fin

source: Rename files manually
es: Renombrar archivos manualmente
fr: Renommer les fichiers manuellement

source: New file name
es: Nombre de archivo nuevo
fr: Nouveau nom de fichier

source: Select the file to rename, change its name and click Preview
es: Seleccione el archivo a renombrar, cambie su nombre y haga click en "Vista previa"
fr: Sélectionnez le fichier à renommer, changez son nom et cliquez sur "Aperçu"

source: Options
es: Opciones

source: Rename _mode:
es: _Modo de renombrado:
fr: _Mode de renommage:

source: _Selection pattern:
es: Patrón de _selección de archivos:
fr: Règle de _sélection des fichiers:

source: * Matches everything ? Matches any single character [seq] Matches any character in seq [!seq] Matches any character not in seq Examples: Select every file *.jpg Select only files ending with the "jpg" extension m* Select only files starting with "m" [0-9]* Select only files starting with a number
es: * Coincide con todo ? Coincide con un solo carácter [seq] Coincide con cualquier carácter presente en seq [!seq] Coincide con cualquier carácter ausente en seq Ejemplos: Selecciona todos los archivos *.jpg Selecciona archivos que acaben con la extensión "jpg" m* Selecciona archivos que empiecen con "m" [0-9]* Selecciona archivos que empiecen con un número

source: Files
es: Archivos
fr: Fichiers

source: Directories
es: Directorios
fr: Répertoires

source: Files and Directories
es: Archivos y Directorios
fr: Fichiers et Répertoires

source: Show _hidden files and directories
es: Muestra archivos y directorios _ocultos
fr: Afficher les fichiers et répertoires _cachés

source: Add files _recursively
es: Añadir archivos _recursivamente
fr: Ajouter les fichiers _récursivement

source: Keep _extensions
es: Mantener _extensiones
fr: Garder les _extensions

source: _Preview automatically
es: Vista _previa automática
fr: _Aperçu automatique

source: Patterns editor
es: Editor de patrones
fr: Éditeur de règles

source: pattern
es: patrón
fr: règle

source: _Add
es: _Añadir
fr: _Ajouter

source: _Remove
es: _Eliminar

source: _Edit
es: _Editar
fr: É_dition

source: _Up
es: _Subir

source: _Down
es: _Bajar

source: Save
es: Guardar

source: Edit
es: Editar
fr: Édition

source: Rename files using patterns
es: Renombrar archivos usando patrones
fr: Renommer les fichiers en utilisant des règles

source: Original file name pattern
es: Patrón de nombre de archivo original
fr: Règle du nom de fichier original

source: Renamed file name pattern
es: Patrón de nombre de archivo renombrado
fr: Règle du nom de fichier renommé

source: Put the mouse over the text fields to get help on which patterns you can use
es: Ponga el ratón sobre los campos de texto para obtener ayuda sobre los patrones que puede usar
fr: Survolez avec la souris les champs de texte pour obtenir de l'aide sur les règles disponibles

source: Preferences
es: Preferencias
fr: Préférences

source: Default directories
es: Directorios predeterminados
fr: Répertoires par défaut

source: The root of the directory tree
es: Raíz del árbol de directorios

source: Select root directory
es: Seleccione el directorio raíz
fr: Sélectionnez le répertoire racine

source: _Root:
es: _Raíz:
fr: _Racine:

source: The default selected directory
es: El directorio seleccionado por defecto
fr: Le répertoire sélectionné par défaut

source: _Active:
es: _Activo:
fr: _Actif:

source: Select active directory
es: Seleccione el directorio activo
fr: Sélectionnez le répertoire actif

source: Common substitutions
es: Sustituciones comunes
fr: Substitutions générales

source: Spaces
es: Espacios
fr: Espaces

source: Replace
es: Reemplazar
fr: Remplacer

source: with
es: con
fr: par

source: Capitalization
es: Capitalización
fr: Majuscules

source: Remove accents
es: Eliminar acentos
fr: Effacer accents

source: Fix duplicated symbols
es: Arreglar símbolos duplicados
fr: Réparer les symboles dupliqués

source: Spaces to Underscores
es: Espacios a Guiones bajos
fr: Espaces en tirets bas

source: Underscores to Spaces
es: Guiones bajos a Espacios
fr: Tirets bas en espaces

source: Spaces to Dots
es: Espacios a Puntos
fr: Espaces en points

source: Dots to Spaces
es: Puntos a Espacios
fr: Points en espaces

source: Spaces to Hyphens
es: Espacios a Guiones
fr: Espaces en tirets

source: Hyphens to Spaces
es: Guiones a Espacios
fr: Tirets en espaces

source: ALL IN UPPERCASE
es: TODO EN MAYÚSCULAS
fr: TOUTES EN MAJUSCULES

source: all in lowercase
es: todo en minúsculas
fr: toutes en minuscules

source: First letter in uppercase
es: Primera letra en mayúsculas
fr: Première en majuscule

source: First Letter Of Each Word In Uppercase
es: Primera Letra De Cada Palabra En Mayúsculas
fr: Première Lettre De Chaque Mot En Majuscule
